In [164]:
import numpy as np
import pandas as pd

In [165]:
pd.__version__

'1.4.1'

In [166]:
df = pd.read_csv('../../../dataset/property_data.csv')

In [167]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 632.0+ bytes

# Check Standard Missing Values

In [169]:
df['SQ_FT']

0    1000
1      --
2     850
3     700
4    1600
5     800
6     950
7     NaN
8    1800
Name: SQ_FT, dtype: object

In [170]:
df['SQ_FT'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

'--' belum dianggap null

Hitung NaN manual

In [171]:
df['SQ_FT'].isnull().sum()

1

Tambahkan '--' sebagai missing value

In [172]:
missing_values = ["n/a", "na", "--"]

In [173]:
df = pd.read_csv('../../../dataset/property_data.csv', na_values = missing_values)

In [174]:
print(df)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

Lihat di SQ_FT, '--' sudah dianggap sebagai NaN

## Unexpected Missing Values

In [175]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0   BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [176]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  5 non-null      float64
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         7 non-null      float64
dtypes: float64(4), object(3)
memory usage: 632.0+ bytes

Dtype object harusnya string, kalau int/float/date tetapi jadi object, kemungkinan ada wrong atau missing values

In [177]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [178]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [179]:
df['OWN_OCCUPIED'].unique()

array(['Y', 'N', '12', nan], dtype=object)

ada missing value berisi 12, seharusnya Y atau N

In [180]:
#Bisa pakai loc atau iloc karena labelnya sama dengan index, start dari 0
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

In [181]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

Cek missing values di kolom lain

In [182]:
df.isnull().sum() #Cek jumlah masing-masing

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        1
SQ_FT           2
dtype: int64

In [183]:
df.isnull().sum().sum() #Total missing value

12

In [184]:
df.isnull().sum().any() #Cek keseluruhan ada atau tidak missing value

True

# Replace Missing Value

Ada saat dimana missing value perlu diganti, secara statistik biasanya pakai mean kalau tidak ada outlier atau median jika ada outlier

In [185]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

Pada kasus ini akan diganti dengan 125 untuk semua missing value

In [186]:
df['ST_NUM'].fillna(125, inplace=True)

In [187]:
df['ST_NUM']

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

Ganti tipe data

In [188]:
df['ST_NUM'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 9 entries, 0 to 8
Series name: ST_NUM
Non-Null Count  Dtype
--------------  -----
9 non-null      float64
dtypes: float64(1)
memory usage: 200.0 bytes

In [189]:
df['ST_NUM'] = df['ST_NUM'].astype('int64')

0    104
1    197
2    125
3    201
4    203
5    207
6    125
7    213
8    215
Name: ST_NUM, dtype: int64

Ada saat kita hanya ingin mengganti row tertentu saja

In [190]:
df['ST_NUM']

0    104
1    197
2    125
3    201
4    203
5    207
6    125
7    213
8    215
Name: ST_NUM, dtype: int64

In [191]:
df.loc[2,'ST_NUM'] = 125

0    104
1    197
2    125
3    201
4    203
5    207
6    125
7    213
8    215
Name: ST_NUM, dtype: int64

In [ ]:
df['ST_NUM']

Ganti dengan median

In [192]:
df['NUM_BEDROOMS']

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    NaN
8    NaN
Name: NUM_BEDROOMS, dtype: float64

In [193]:
df['NUM_BEDROOMS'].fillna(df['NUM_BEDROOMS'].median(),inplace=True)

0    3.0
1    3.0
2    3.0
3    1.0
4    3.0
5    3.0
6    2.0
7    3.0
8    3.0
Name: NUM_BEDROOMS, dtype: float64

In [194]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0     104      PUTNAM            Y           3.0        1  1000.0
1  100002000.0     197   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     125   LEXINGTON            N           3.0        1   850.0
3  100004000.0     201    BERKELEY          NaN           1.0      NaN   700.0
4          NaN     203    BERKELEY            Y           3.0        2  1600.0
5  100006000.0     207    BERKELEY            Y           3.0        1   800.0
6  100007000.0     125  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0     213     TREMONT            Y           3.0        1     NaN
8  100009000.0     215     TREMONT            Y           3.0        2  1800.0